---
kind: type
id: T:Autodesk.Revit.Exceptions.ArgumentNullException
source: html/631e1424-60f4-929b-4e52-dda9dcd26316.htm
---
# Autodesk.Revit.Exceptions.ArgumentNullException

The exception that is thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is passed to a method that does not accept it as a valid argument.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ArgumentNullException : ArgumentException
```